Documents/ОказаниеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОказаниеУслуги</Name>
			<Comment>Оказание услуги</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Инвентарь</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Comment>Мастер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>ВидОплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>СуммаДокумента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ПереченьНоменклатура</Name>
					<Comment>Перечень номенклатура</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Comment>Материал</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Comment>Набор свойств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Услуги</Name>
					<Comment>Услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОказаниеУслуги/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УслугиНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Услуги.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ПолучитьРозничнуюЦену(Объект.Дата,ТекущаяСтрока.Номенклатура);
КонецПроцедуры 

&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура)
	Результат = РозничнаяЦена(АктуальнаяДата, Номенклатура);
	Возврат Результат;
КонецФункции
